In [2]:
import pandas as pd
import numpy as np

In [3]:
data= {'Company': ['FB', 'FB', 'GOOG', 'GOOG', 'MSFT', 'MSFT'],
    'Person' : ['Malik','Ali','Nawab','Khan','Bangash','Pathan'],
    'Sales'  : [200,300, 400, 500, 600, 700]}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

  Company   Person  Sales
0      FB    Malik    200
1      FB      Ali    300
2    GOOG    Nawab    400
3    GOOG     Khan    500
4    MSFT  Bangash    600
5    MSFT   Pathan    700

In [6]:
df.replace('Malik','raisan', inplace = True)

In [7]:
df

  Company   Person  Sales
0      FB   raisan    200
1      FB      Ali    300
2    GOOG    Nawab    400
3    GOOG     Khan    500
4    MSFT  Bangash    600
5    MSFT   Pathan    700

In [8]:
df.loc[df['Person'] == 'Pathan', 'Person'] = 'Shujat' # you can also used 'at' instead of loc.

In [9]:
df

  Company   Person  Sales
0      FB   raisan    200
1      FB      Ali    300
2    GOOG    Nawab    400
3    GOOG     Khan    500
4    MSFT  Bangash    600
5    MSFT   Shujat    700

In [10]:
# you can also change any value based on its location.

In [11]:
df.loc[3, 'Person'] = 'DDKhan'

In [12]:
df

  Company   Person  Sales
0      FB   raisan    200
1      FB      Ali    300
2    GOOG    Nawab    400
3    GOOG   DDKhan    500
4    MSFT  Bangash    600
5    MSFT   Shujat    700

In [13]:
df['Financial Status'] = np.where(df['Sales'] >= 400, True, False)

In [14]:
df

  Company   Person  Sales  Financial Status
0      FB   raisan    200             False
1      FB      Ali    300             False
2    GOOG    Nawab    400              True
3    GOOG   DDKhan    500              True
4    MSFT  Bangash    600              True
5    MSFT   Shujat    700              True

In [15]:
df['Person'].mask(df['Sales'] == 300, 0)

0     raisan
1          0
2      Nawab
3     DDKhan
4    Bangash
5     Shujat
Name: Person, dtype: object

In [16]:
df

  Company   Person  Sales  Financial Status
0      FB   raisan    200             False
1      FB      Ali    300             False
2    GOOG    Nawab    400              True
3    GOOG   DDKhan    500              True
4    MSFT  Bangash    600              True
5    MSFT   Shujat    700              True

In [17]:
df1 = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [6, 7, 8, 9, 10],
    'C': [11, 12, 13, 14, 15]
})
df2 = pd.DataFrame({
    'A': [11, 22, 33, 44, 55],
    'B': [66, 77, 88, 99, 101],
    'C': [111, 122, 133, 144, 155]
})

In [18]:
df1.update(df2)

In [19]:
df1 # df1 is completely changed by df2.

    A    B    C
0  11   66  111
1  22   77  122
2  33   88  133
3  44   99  144
4  55  101  155

In [20]:
"""apply only works for single column and row.
map is also similar to apply,
applymap applys to whole dataframe."""

'apply only works for single column and row.\nmap is also similar to apply,\napplymap applys to whole dataframe.'

In [21]:
a = pd.Series(['cat', 'dog', 'NaN', 'rabbit'])
a

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [22]:
a.map({'cat': 'kitten', 'dog' : 'poppy'}) # it will replace the matching one and return all others as NaN.

0    kitten
1     poppy
2       NaN
3       NaN
dtype: object

In [23]:
a

0       cat
1       dog
2       NaN
3    rabbit
dtype: object

In [24]:
def change_words(title):
    return title.replace('Shujat', 'Punjabi')

df['Person'].map(change_words)

0     raisan
1        Ali
2      Nawab
3     DDKhan
4    Bangash
5    Punjabi
Name: Person, dtype: object

In [25]:
df['Person'].map("This is {}".format)

0     This is raisan
1        This is Ali
2      This is Nawab
3     This is DDKhan
4    This is Bangash
5     This is Shujat
Name: Person, dtype: object

In [26]:
df

  Company   Person  Sales  Financial Status
0      FB   raisan    200             False
1      FB      Ali    300             False
2    GOOG    Nawab    400              True
3    GOOG   DDKhan    500              True
4    MSFT  Bangash    600              True
5    MSFT   Shujat    700              True

In [27]:
df['Sales'] = df['Sales']+10

In [28]:
df

  Company   Person  Sales  Financial Status
0      FB   raisan    210             False
1      FB      Ali    310             False
2    GOOG    Nawab    410              True
3    GOOG   DDKhan    510              True
4    MSFT  Bangash    610              True
5    MSFT   Shujat    710              True

In [33]:
df['Win'] = df['Sales'].apply(lambda x : 1 if x > 400 else 0)

In [34]:
df

  Company   Person  Sales  Financial Status  Win
0      FB   raisan    210             False    0
1      FB      Ali    310             False    0
2    GOOG    Nawab    410              True    1
3    GOOG   DDKhan    510              True    1
4    MSFT  Bangash    610              True    1
5    MSFT   Shujat    710              True    1

In [35]:
df[df['Company'] == 'GOOG'] # This is used for filtering.

  Company  Person  Sales  Financial Status  Win
2    GOOG   Nawab    410              True    1
3    GOOG  DDKhan    510              True    1

In [36]:
df[df['Person'].isna()] # to check any null value present.

Empty DataFrame
Columns: [Company, Person, Sales, Financial Status, Win]
Index: []

In [38]:
df[~df['Person'].isna()] # it used to show values expect None.

  Company   Person  Sales  Financial Status  Win
0      FB   raisan    210             False    0
1      FB      Ali    310             False    0
2    GOOG    Nawab    410              True    1
3    GOOG   DDKhan    510              True    1
4    MSFT  Bangash    610              True    1
5    MSFT   Shujat    710              True    1

In [40]:
df[df['Sales'].isin([200, 210, 410, 510, 5, 7, 3])]

  Company  Person  Sales  Financial Status  Win
0      FB  raisan    210             False    0
2    GOOG   Nawab    410              True    1
3    GOOG  DDKhan    510              True    1

In [41]:
df

  Company   Person  Sales  Financial Status  Win
0      FB   raisan    210             False    0
1      FB      Ali    310             False    0
2    GOOG    Nawab    410              True    1
3    GOOG   DDKhan    510              True    1
4    MSFT  Bangash    610              True    1
5    MSFT   Shujat    710              True    1

In [42]:
df[(df['Company'] == 'FB') & (df['Person'] == 'Ali')]

  Company Person  Sales  Financial Status  Win
1      FB    Ali    310             False    0